import React from 'react';
import Head from 'next/head';
import { current } from '../config';

import Wrapper from '../components/Wrapper';
import Header from '../components/Header';
import Content from '../components/Content';
import Article from '../components/Article';
import ArticlesGroup from '../components/ArticlesGroup';
import Footer from '../components/Footer';

const IndexPage = () => {
  const {
    title,
    description,
    keywords,
    language,
    social,
  } = current.meta;

  const article = {
    title: '«Шоб ти здох». Як правильно матюкати людей',
    path: 'shob-ty-zdoh',
    intro: '«Шоб ти здох» — це серія статей про те, шоб ти здох. В ній ми намагаємось розкрити тему здихання.',
    featuredImage: '/static/demo/mountains.jpg',
    body: `<p>Інтерв'ю́ (англ. interview) — це бесіда, вибудована за певним планом через безпосередній контакт інтерв'юера з респондентом з обов'язковою фіксацією відповідей. В соціології використовується як один з основних методів збору первинної соціологічної інформації. В журналістиці є самостійним жанром, що представляє суспільно вагому новину у вигляді відповідей особи на запитання журналіста.<p><p>У журналістиці інтерв'ю використовується як метод збору інформації та як жанр. Інтерв'ю — призначена для опублікування в пресі, передачі по радіо, телебаченню розмова журналіста з політичним, громадським або яким-небудь іншим діячем. Якщо сама бесіда, її хід, — не стали предметом відображення в тексті, а журналіст просто використав дані для публікації, говоримо про те, що журналіст користувався інтерв'ю як методом збору інформації. Якщо ж автор подав розмову у формі запитань та відповідей, то це жанр інтерв'ю.</p><p>Складаючись із гуманітарних наук, соціологія витворює ядро соціальних наук. Об'єктом соціології є соціальна реальність у всій багатоманітності, але оскільки вона досить мінлива, то предмет соціології надзвичайно складно визначити, він не може бути постійним, статичним. Таким чином, соціологія вивчає всі сторони соціального співжиття людей в спільнотах і союзах, в той час, як інші соціальні дисципліни, такі як політологія чи економіка, встановлюють своїми предметами певні специфічні аспектні області соціального (політика — легітимне здійснення влади, економіка — дефіцит). Соціологія звертається до розуміння і систематизації соціальної дії — теорії дій, оскільки згідно з ними поведінка регулюється цінностями і нормами. Її дослідницьким предметом є як суспільство в цілісності, так і його окремі частини: соціальні системи, інститути, організації, групи. При цьому, вона має справу з суспільною інтеграцією і дезінтеграцією, із соціальними конфліктами та соціальними змінами.</p><img src="/static/demo/bible.jpg"/><p>В соціології як у науці про соціальне теорія і досвід посилаються один на одне. Соціологія
прагне емпірично змістовно і слідуючи правилам логіки зрозуміти спостережуване і
розвинути його пояснення за допомогою загальних положень (аксіом). Подвійність
дослідницьких засад в ній відповідає цьому — з одного боку герменевтичні інтерпретування,
а з іншого каузальні методи, при чому перші приймають перспективу учасника, останні —
спостерігача.</p><blockquote>Чим більше я знаю, тим більше я не знаю, а чим більше я не знаю, тим більше я і не знаю</blockquote><p>Поняття «суспільство» в соціології посилається на зв'язки і співвідношення між окремими
людьми. Отже, об'єднує не одні лиш просторові, кількісні показники індивідів, але і їхню
соціальність. Таким чином, завдяки неперервним зразкам поведінки наміченими є
структури, які одержують своє походження з міжлюдських вчинків і реалізують свій вплив в
цій сфері. В соціології не існує єдності щодо специфічних прикмет для суспільства.
Найзагальніше визначення суспільства визначається як «відповідна щонайосяжніша
система людського співжиття».</p><img class="image-full-width" src="/static/demo/concert.jpg"/><p>Крім того, тематичні області соціології можуть розрізнятись за тим, чи є вони віднесеними
до загальної соціології, тобто претендують на універсальну силу, або чи йдеться в них про
теми спеціальної соціології. Соціологічні методи теоретично відносяться до загальної
соціології, проте у практиці вищої школи ними часто займаються окремо.</p>`,
    publishedAt: new Date(),
    tags: ['туфта', 'шобтиздох', 'соціологія'],
  };

  const relatedArticles = [
    {
      title: 'Мужичок в капелюсі: хто він в біса такий?',
      path: 'granny-in-hat',
      brief: 'Розповідь про дивного мужичка в не менш дивному капелюсі та окулярах.',
      image: '/static/demo/pa.jpg',
    },
    {
      title: 'Двоє чуваків грають в шахи, і поки шо не ясно, хто виграє',
      path: 'guys-playing-chess',
      brief: 'Один білий, другий сірий, третій в капелюсі.',
      image: '/static/demo/chess.jpg',
    },
    {
      title: 'Якась дівуля дивиться вбік',
      path: 'girl-looking-somewhere',
      brief: 'Шо там могло бути? Може, Карлсон прилетів на своєму пропелері? Може, Карлсон прилетів на своєму пропелері?',
      image: '/static/demo/girl.jpg',
    },
    {
      title: 'Прогноз погоди',
      path: 'weather-forecast',
      brief: 'Мінлива хмарність, вітер 5-10 м/c, опади малоімовірні.',
      image: '/static/demo/sky.jpg',
    },
    {
      title: 'Той самий мужичок',
      path: 'grunny-in-hat-2',
      brief: 'Його не буває забагато.',
      image: '/static/demo/pa.jpg',
    },
  ];

  return (
    <Wrapper>
      <Head>
        <title>{title}</title>
        <meta name="description" content={description} key="description" />
        <meta name="keywords" content={keywords.join(', ')} key="keywords" />

        <meta name="twitter:card" content="summary" />
        <meta name="twitter:title" content={title} />
        <meta name="twitter:description" content={description} />
        <meta name="twitter:site" content={social.twitter.username} />
        <meta name="twitter:creator" content={social.twitter.username} />

        <meta name="og:title" content={title} />
        <meta name="og:description" content={description} />
        <meta name="og:url" content={current.clientURL} />
        <meta name="og:site_name" content={title} />
        <meta name="og:locale" content={language} />
        <meta name="og:type" content="website" />
      </Head>
      <Header />
      <Content className="container">
        <Article {...article} />
        <ArticlesGroup articles={relatedArticles} title="Інше з проекту «Шоб ти здох»" />
      </Content>
      <Footer />
    </Wrapper>
  );
};

export default IndexPage;
